### Creating an ETL Pipeline where in we are taking data which is layoffs.csv dataset and loading it into the MySQL database which is the target database using required libraries and using Python as the programming language

In [15]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import mysql.connector
import pymysql

In [9]:
df = pd.read_csv('layoffs.csv')
df.head(5)

,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country,funds_raised_millions
0,Atlassian,Sydney,Other,500.0,0.05,3/6/2023,Post-IPO,Australia,210.0
1,SiriusXM,New York City,Media,475.0,0.08,3/6/2023,Post-IPO,United States,525.0
2,Alerzo,Ibadan,Retail,400.0,NaN,3/6/2023,Series B,Nigeria,16.0
3,UpGrad,Mumbai,Education,120.0,NaN,3/6/2023,Unknown,India,631.0
4,Loft,Sao Paulo,Real Estate,340.0,0.15,3/3/2023,Unknown,Brazil,788.0

In [10]:
print(pd.__version__)

2.1.1

In [ ]:
## syntax for establishing connection to mysql 
## create_engine ("mysql+pymysql://username:Password@localhost:portnumber/data_base_name_in_schema")
try:
    engine_mysql = create_engine("mysql+pymysql://root:NewStrongPassword123@localhost:3306/layoff_db")
    engine_mysql
    print("Connection successful with MySQL")
except Exception as e:
    print("Unable to connect:", e)

Connection successful with MySQL

In [35]:
df.to_sql(name="layoff", con=engine_mysql, if_exists='append', index= True)

2361